Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: སྨྲས་པ། གལ་ཏེ་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་མ་བྱས་ལ་གལ་ཏེ་བདེན་པ་རྣམས་མ་མཐོང་ན་ཕྱིར་ཡང་བསླང་བར་ནུས་སོ། །ཡང་སྨྲས་པ།
en: Venerable Śāradvatīputra said, “Yes, they can be repaired unless they have realized the limit of reality and unless they see the truths.

source: འདི་ལ་ཚེ་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་མི་བྱའོ།
en: Venerable One, when bodhisattvas wish to awaken to unsurpassed and perfect buddhahood, they should not realize the limit of reality.”

source: །སྨྲས་པ། ཅིའི་ཕྱིར།
en: Venerable Pūrṇa asked, “Why is that?”

source: སྨྲས་པ། ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་བར་འགྱུར་དུ་འོང་བའི་ཕྱིར་ཏེ།
en: Venerable Śāradvatīputra said, “Because to do so would lead them to fall to the levels of the hearers and solitary buddhas.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལ་གནས་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་སྐལ་བ་མེད་པའི་ཕྱིར་རོ།
en: When they are on the levels of the hearers and solitary buddhas they do not have the fortune of arousing the mind set upon omniscience.

source: །གལ་ཏེ་དེ་ཆོས་ནུབ་པར་གྱུར་པའི་ཚེ་བྱུང་ན་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཐོབ་པར་རང་བྱང་ཆུབ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་རོ།
en: Then, if it should happen that the Dharma disappears, they would end up manifesting awakening on their own rather than attaining omniscience.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་རྒྱུ་འདིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པར་མ་གྱུར་གྱི་བར་དུ་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་བྱར་མ་གནང་ངོ་།
en: Venerable Pūrṇa, for this reason they should not realize the limit of reality until they sit at the seat of awakening.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཚུལ་ཁྲིམས་དེ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་གདགས་པའི་ཕྱིར་མངོན་པར་མི་སྒྲུབ་ན། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་མ་ཡིན་ནོ།
en: Venerable Pūrṇa, moreover, when bodhisattvas practice the perfection of discipline, they will only be upholding the perfection of discipline if they practice in order to benefit all beings.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཚད་ཡོད་པ་རྣམས་ཀྱི་ཆེད་དུ་སྦྱིན་པ་སྦྱིན་ནམ། ཚུལ་ཁྲིམས་སྲུང་ན། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་མ་ཡིན་ནོ།
en: Venerable Pūrṇa, if bodhisattvas practice generosity, or maintain discipline, for the sake of a limited number of beings, they are not upholding the perfection of discipline.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཚད་ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་རོ། །
en: Because the perfection of discipline is boundless.”

source: སྨྲས་པ། བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་གང་ཡིན་སྨྲས་པ།
en: Venerable Pūrṇa asked, “What is the bodhisattva discipline for bodhisattvas?”

source: སྦྱིན་པ་གང་དང་གང་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་སྲུང་བ་དེ་ཐམས་ཅད། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་བྱེད་ན། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་སོ།
en: Venerable Śāradvatīputra replied, “If they dedicate the merit of any practice of generosity or any observance of discipline toward omniscience, that is the bodhisattva discipline for bodhisattvas.

source: །གལ་ཏེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ། ཚུལ་ཁྲིམས་བསྒོམ་པའི་ཕྱིར་སྤྱོད་ལ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་མི་སྔོ་ན། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་མ་ཡིན་ནོ།
en: If bodhisattvas practice discipline for as many eons as there are grains of sand in the Ganges, yet fail to dedicate the merit toward omniscience, they do not uphold the perfection of discipline.

source: །གལ་ཏེ་ཉན་ཐོས་ཉིད་དམ། རང་སངས་རྒྱས་ཉིད་དུ་ཡང་ཡོངས་སུ་མི་སྔོ་ན། དེ་ལྟར་ན་ཡང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་མ་ཡིན་ཏེ།
en: However, though bodhisattvas may not dedicate their merit toward becoming a hearer or a solitary buddha, that in itself also does not constitute the perfection of discipline.

source: དེས་ཚུལ་ཁྲིམས་འཆལ་པར་ཡང་མི་བརྩིའོ།
en: Still, neither is it considered a lapse in discipline.

source: །གལ་ཏེ་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་སྔོ་ན། དེ་ཙམ་གྱིས་ན་དེ་ཚུལ་ཁྲིམས་འཆལ་པ་ཞེས་བྱའོ།
en: It is when bodhisattvas dedicate their merit toward becoming a hearer or a solitary buddha that their discipline is said to be faulty.

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་མ་ཡིན་པའི་ཕྱིར་རོ།
en: Because that is no longer the domain of bodhisattvas.

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་གང་ཡིན་སྨྲས་པ།
en: Venerable Pūrṇa asked, “Venerable Śāradvatīputra, what is the domain of bodhisattvas like?”

source: འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་རྣམས་ཏེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྤྱོད་ཡུལ་ལོ།
en: Venerable Śāradvatīputra replied, “It refers to any state of mind that involves the six perfections and the state of omniscience—such is the domain of bodhisattva great beings.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་ཁྱིམ་ན་གནས་ཏེ། འདོད་པའི་ཡོན་ཏན་ལྔ་རྣམས་ལ་སྟེན་ཅིང་ལོངས་སྤྱོད་ལ། ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡང་སེམས་མི་སྐྱེད་ན། དེ་ཙམ་གྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་འཆལ་པ་ཞེས་མི་བརྗོད་དོ།
en: If bodhisattvas remain as householders for as many eons as there are grains of sand in the Ganges, involved with the five sense pleasures and enjoying them, yet have no thoughts of attaining the level of a hearer or a solitary buddha, that in itself is not said to be faulty bodhisattva discipline.

source: དེ་ལྟར་འདིས་འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལྷག་པའི་བསམ་པ་མ་དཀྲུགས་པའི་ཕྱིར་རོ།
en: Because it does not disturb their determination to attain omniscience.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། མི་ལ་ལ་ཞིག་ཉེས་པ་མེད་པར་བཙོན་རར་བཅུག་སྟེ།
en: Venerable Pūrṇa, as an analogy, an innocent man may be thrown in jail for a long time.

source: དེ་བཙོན་ར་དེར་ལོ་མང་པོ་ལོ་བརྒྱ་ཕྲག་མང་པོ། ལོ་འབུམ་ཕྲག་མང་པོར་བཙོན་རར་བཅུག་ལ།
en: He may even be incarcerated for many hundreds, thousands, or hundreds of thousands of years.

source: དེའི་ལྷག་པའི་བསམ་པ་ཡང་འཁྲུགས་པར་མ་གྱུར། དེས་རྐུན་པོའི་སེམས་ཀྱང་མ་བསྐྱེད་དུ་ཟིན་ཀྱང་།
en: Yet his determination to be free is not shaken thereby, nor will he develop any criminal inclinations in the process.

source: དེ་བཙོན་རར་བཅུག་ན། དེ་ཙམ་གྱིས་ནི་དེ་རྐུན་པོ་ཞེས་བརྗོད་པ་མ་ཡིན་ནོ།
en: He may be locked up, but that does not make him a thief.

source: །ཚེ་དང་ལྡན་པ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཡང་ཁྱིམ་ན་གནས་ཤིང་། འདོད་པའི་ཡོན་ཏན་ལྔ་རྣམས་ལ་ཡོངས་སུ་ལོངས་སྤྱོད་པ་དེས། ཚུལ་ཁྲིམས་འཆལ་པ་ཞེས་བྱ་བར་མི་བརྗོད་དོ།
en: Venerable One, likewise, bodhisattvas may live as householders and enjoy the five sense pleasures, but that does not make their discipline faulty.

source: །གལ་ཏེ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་ཚངས་པར་སྤྱད་པ་སྤྱོད་ལ། དེ་ཡང་ཉན་ཐོས་ཀྱི་སའམ་རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་སྔོ་ཞིང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལྷག་པའི་བསམ་པ་ཡང་འཁྲུགས་ན་དེ་ཙམ་གྱིས་ན་དེ་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཞེས་མི་བྱའོ།
en: If certain people practice pure conduct for as many eons as there are grains of sand in the Ganges yet dedicate the merit toward becoming a hearer or a solitary buddha and thus are swayed from their determination to attain omniscience, their pure conduct alone does not make them disciplined.

source: །གང་གི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉན་ཐོས་ཀྱི་ཚུལ་ཁྲིམས་ལ་གནས་ན་དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བརྗོད་དོ།
en: Whoever attempts to practice the perfection of discipline by observing the discipline of the hearers is not called a bodhisattva.

source: འདི་ལྟར་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་འགལ་བའི་ཕྱིར་རོ།
en: Because they are at odds with the perfection of discipline.”

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ལེའུ་དང་པོའོ།། །།
en: This is the first chapter from “The Perfection of Discipline.”

source: ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་བསྐལ་པ་མཐའ་ཡས་པར་མཚམས་སྦྱར་ཞིང་འཁོར་བར་བྱས་ལ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་བསྐྱེད་དེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས།
en: Venerable Śāradvatīputra continued, “Venerable Pūrṇa, moreover, bodhisattvas should think in the following way: ‘I will remain in existence, taking rebirth for endless eons, in order to develop the mind of omniscience and attain the state of omniscience.’ ”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་འདི་ལྟར་བསྐལ་པ་འདི་སྙེད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱའོ་ཞེས་ཚད་ངེས་པར་བྱེད་པར་གྱུར་ན། འདི་ལ་ཉེས་པ་ཅི་ཡོད།
en: Venerable Pūrṇa asked Venerable Śāradvatīputra, “Venerable Śāradvatīputra, why would it be wrong if bodhisattvas were to decide, ‘I wish to attain omniscience after such-and-such many eons’?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་འཁོར་བས་སྐྲག་ཅིང་རིངས་ཏེ། དེ་རིངས་པས་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པར་ཡང་ཚད་ཡོད་པ་ཉིད་དུ་གྱུར་ཏེ།
en: Venerable Śāradvatīputra replied, “Venerable Pūrṇa, if bodhisattvas are afraid or anxious about cyclic existence, their eagerness to leave saṃsāra will limit the ripening of their roots of virtue.

source: དེ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་གཉིས་སུ་འགྱུར་བར་ཤེས་པར་བྱ་སྟེ།
en: In that way this practice becomes like the practice of the hearers and solitary buddhas.

source: ཚད་ཡོད་པས་ནི་སེམས་ཅན་ཚད་མེད་པ་རྣམས་ཀྱི་དོན་བྱ་བར་མི་ནུས་སོ།
en: Limited in that way, they will be unable to benefit limitless beings.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཚད་མེད་གྲངས་མེད་པས་ན་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པ་མ་གཏོགས་པར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་མེད་དོ།
en: Venerable Pūrṇa, the perfection of generosity is limitless and boundless. Therefore, the perfection of generosity is only mastered with the attainment of omniscience.

source: །གལ་ཏེ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱང་ད་དུང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་ཏེ།
en: Even if one were to train in the perfection of generosity for as many eons as there are grains of sand in the Ganges, the perfection of generosity would not be perfected.

source: མཐའ་ཡས་པའི་ཕྱིར་ན། དེའི་ཚེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: Since the perfection of generosity is boundless, it is accomplished with the attainment of omniscience.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཇི་ལྟ་ཇི་ལྟར་ཤིན་ཏུ་ཡུན་རིང་པོར་མཚམས་སྦྱོར་ཞིང་། འཁོར་བ་དེ་ལྟ་དེ་ལྟར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལེགས་པར་ཡོངས་སུ་བསྒོམས་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, therefore, the longer bodhisattvas who wish to awaken to unsurpassed and perfect buddhahood take rebirth in existence, the more proficient they will become in the perfection of generosity. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། སྣོད་སར་པ་སྨན་གྱི་ཁུ་བའི་ཆུས་བཀང་སྟེ་བཞག་ན། ཇི་ལྟ་ཇི་ལྟར་བཞག་པ་དེ་ལྟ་དེ་ལྟར་ཤིན་ཏུ་བསྒོས་པ་དང་། ཤིན་ཏུ་སྲ་བར་འགྱུར་རོ།
en: Venerable Pūrṇa, the longer you set aside a fresh clay container filled with a medicinal elixir, the more the elixir will infuse and fortify the container.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཇི་ལྟ་ཇི་ལྟར་ཤིན་ཏུ་ཡུན་རིང་པོར་མཚམས་སྦྱོར་ཞིང་། འཁོར་བ་དེ་ལྟ་དེ་ལྟར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལེགས་པར་བསྒོམས་ཤིང་ཆེས་བརྟན་པར་འགྱུར་བ་དང་། ལྗིད་བཟོད་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, likewise, the longer bodhisattva great beings remain taking rebirth in existence, the more proficient they will become in the perfection of generosity and the more they will gain stability and fortitude.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་བུམ་པ་སར་པའི་ནང་དུ་མར་རམ་ཏིལ་མར་བཞག་ན། དེ་ཇི་ལྟ་ཇི་ལྟར་ཤིན་ཏུ་ཡུན་རིང་དུ་བཞག་པ་དེ་ལྟ་དེ་ལྟར་བུམ་པ་དེ་སྣུམ་དང་ལྡན་པར་འགྱུར་ཏེ། བུམ་པ་དེ་སྣུམ་གྱིས་ཁྱབ་པར་མ་གྱུར་པ་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: Venerable Pūrṇa, as an analogy, the longer you leave a fresh clay jar filled with ghee or sesame oil, the more the oil will permeate the jar until finally it pervades the entire jar.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཇི་ལྟ་ཇི་ལྟར་ཤིན་ཏུ་ཡུན་རིང་པོར་མཚམས་སྦྱོར་ཞིང་། འཁོར་བ་དེ་ལྟ་དེ་ལྟར་སངས་རྒྱས་རྣམས་དང་། འཕགས་པ་ཉན་ཐོས་རྣམས་དང་ཕྲད་པ་ཐོབ་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, likewise, the longer bodhisattva great beings remain taking rebirth in existence, the more they will be able to encounter the buddhas and the noble hearers.

source: །ཇི་ལྟ་ཇི་ལྟར་སངས་རྒྱས་རྣམས་དང་། འཕགས་པ་ཉན་ཐོས་རྣམས་དང་ཕྲད་པ་ཐོབ་པ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོས་སོ།
en: The more buddhas and noble hearers they meet, the more teachings on the perfections they will hear.

source: །ཇི་ལྟ་ཇི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོས་པ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྒོམ་མོ། །ཇི་ལྟ་ཇི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྒོམ་པ་དེ་ལྟ་དེ་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་རོ།
en: The more teachings on the perfections they hear, the more proficient they will become in the perfections. The more proficient they become in the perfections, the closer they will be to omniscience. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་གང་དང་གང་སྐྱེད་པ་དེ་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པ་སྐྱེད་དེ།
en: Venerable Pūrṇa, no matter what state of mind that bodhisattva great beings experience, they will always experience omniscience.

source: སེམས་གཞན་དག་སྐྱེ་བའི་གོ་སྐབས་མི་འབྱེད་དོ།
en: In fact, no other state of mind could possibly occur to them.

source: །གང་གི་ཚེ་སེམས་གཞན་སྐྱེ་བའི་གོ་སྐབས་མི་རྙེད་པ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་རྣམས་ཀྱིས་སེམས་ཀྱི་རྒྱུད་ཡོངས་སུ་བསྒོས་པ་ཞེས་བྱའོ།
en: When no other state of mind can occur, the minds of the bodhisattva great beings have become suffused with the six perfections.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་མར་གྱི་བུམ་པ་ནི་གང་དང་གང་ནས་བཟུང་ཡང་། དེ་དང་དེ་མར་གྱི་དྲི་དང་ལྡན་པ་ཉིད་དུ་འགྱུར་རོ།
en: Venerable Pūrṇa, as an analogy, wherever you smell a jar filled with ghee, the smell of the ghee will be present.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་གང་དང་གང་སྐྱེ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པ་ཉིད་སྐྱེ་བར་འགྱུར་རོ།
en: Likewise, no matter what state of mind that bodhisattva great beings experience, they will always experience omniscience.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་ནི་བདུད་སྡིག་ཅན་གྱིས་གླགས་བཙལ་ཀྱང་གླགས་མི་རྙེད་དེ།
en: Even if the evil Māra himself should try to harm such bodhisattva great beings, he would be unsuccessful.

source: དེ་ནི་དམིགས་པ་གང་ལས་གླགས་འཚོལ་བའི་དམིགས་པ་དེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྒོམ་པར་བྱེད་པའི་ཕྱིར་ཏེ།
en: The reason is that no matter which angle the bodhisattvas are being attacked from, they will take any opportunity to meditate on omniscience.

source: དེ་བཞིན་དུ་བདུད་ཀྱི་རིས་རྣམས་ཀྱིས་ཀྱང་གླགས་མི་རྙེད་དོ།
en: In that way no type of demon will be able to harm them. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟ་ཇི་ལྟར་ཤིན་ཏུ་ཡུན་རིང་པོར་མཚམས་སྦྱོར་བ་དེ་ལྟ་དེ་ལྟར་སངས་རྒྱས་རྣམས་དང་། འཕགས་པ་ཉན་ཐོས་རྣམས་དང་ཕྲད་པ་འཐོབ་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, likewise, the longer bodhisattva great beings remain taking rebirth in existence, the more they will be able to encounter the buddhas and the noble hearers.

source: །ཇི་ལྟ་ཇི་ལྟར་སངས་རྒྱས་རྣམས་དང་། འཕགས་པ་ཉན་ཐོས་རྣམས་དང་ཕྲད་པ་འཐོབ་པ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཐོས་པར་འགྱུར་རོ།
en: The more buddhas and noble hearers they meet, the more teachings on the perfections they will hear.

source: །ཇི་ལྟ་ཇི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཐོས་པ་དེ་ལྟ་དེ་ལྟར་དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བྱེད་ཅིང་སྒོམ་མོ།
en: The more teachings on the perfections they hear, the more they will strive for suchness and acquaint themselves with that state.

source: །ཇི་ལྟ་ཇི་ལྟར་ནན་ཏན་བྱེད་ཅིང་སྒོམ་པ་དེ་ལྟ་དེ་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་རོ།
en: The more they strive for suchness and acquaint themselves with that state, the closer they will be to omniscience. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕ་རོལ་ཚུལ་ཁྲིམས་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་ན། ཐོག་མ་ཁོ་ནར་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་འབྱུང་བའི་ཚུལ་ཁྲིམས་དང་ལྡན་པར་གྱུར་ལ།
en: Venerable Pūrṇa, moreover, when bodhisattvas encourage another person to observe discipline, at first the discipline of the other person will be based merely on mind and mental events.

source: དེ་ནས་དེའི་འོག་ཏུ་ཕ་རོལ་ཚུལ་ཁྲིམས་ཡང་དག་པར་འཛིན་དུ་འཇུག་གོ།
en: Only later will the other person engage genuinely in discipline.

source: །དེ་ལྟར་ཡང་དག་པར་འཛིན་དུ་བཅུག་ནས་སེམས་བསྐྱེད་པ་དེ་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་ཚུལ་ཁྲིམས་ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་གང་ཡིན་པ་དེ། བྱང་ཆུབ་སེམས་དཔས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ།
en: When that happens, bodhisattvas will dedicate all the mind states involved in encouraging that person toward the attainment of omniscience and thereby surpass the son or daughter of noble family who is actually observing discipline.

source: །གལ་ཏེ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་གང་ཟག་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རབ་ཏུ་འདོམས་ལ། བཏམས་པའི་སེམས་བསྐྱེད་པ་དེ་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན།
en: If a person who belongs to the vehicle of the hearers introduces a person from the bodhisattva vehicle to the perfection of discipline, bodhisattvas will dedicate those pure intentions toward the state of omniscience.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་གང་དེ་ལ་འདོམས་པ་དེ། བྱང་ཆུབ་སེམས་དཔས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ།
en: In that case bodhisattvas will surpass the person of the vehicle of the hearers who gave the instruction.

source: འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའི་ཕྱིར་རོ།
en: Because bodhisattvas dedicate the merit toward omniscience. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། མི་ལ་ལ་གསེར་གྱི་མི་ཁྱེར་ཏེ་འགྲོ་ན་ཁྱེར་བ་གང་ཡིན་པ་དེ་ཉིད་གསེར་གྱི་མིས་ཁ་དོག་དང་། དབྱིབས་དང་། འོད་ཀྱིས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, as an analogy, if someone carries with them a golden statue, that statue will surpass anything else that they may be carrying in terms of color, shape, and luster.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་གལ་ཏེ་ཉན་ཐོས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདོམས་ན། ཉན་ཐོས་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, likewise, even if as many hearers as there are grains of sand in the Ganges introduce bodhisattvas to the perfection of discipline, all of those hearers will be surpassed by those bodhisattvas.

source: འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བའི་ཕྱིར་རོ།
en: Because they will dedicate the six perfections toward the state of omniscience.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། མི་ཞིག་གིས་ཤེལ་གྱི་མི་པང་པར་ཐོགས་ཏེ་འགྲོ་ན། ཁྱེར་བ་གང་ཡིན་པ་དེ་ཉིད་ཤེལ་གྱི་མིས། ཁ་དོག་དང་། དབྱིབས་དང་། འོད་ཀྱིས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, as a further analogy, if someone walks while holding aloft a crystal statue, any other object that that person may be carrying will be outshone by that crystal statue in terms of color, shape, and luster.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གང་དག་ཡིན་པ་དེ་དག་གི་བྱེ་མ་སྙེད་ཀྱི་ཉན་ཐོས་ཡོད་པར་གྱུར་ལ། དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ན། དེ་དག་ཐམས་ཅད་དེས་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, likewise, even if as many hearers as there are grains of sand in all the Ganges rivers in all the worlds in the great trichiliocosm were to instruct and teach the perfection of discipline to bodhisattvas, all of them would be surpassed by those bodhisattvas because they dedicate the perfection of discipline toward attaining the state of omniscience.

source: །ཇི་ལྟ་ཇི་ལྟར་དེ་དག་འདོམས་པ་དེ་ལྟ་དེ་ལྟར་ཉན་ཐོས་རྣམས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ།
en: The more the hearers instruct them, the more those bodhisattvas will surpass them.

source: །གལ་ཏེ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་འདུག་སྟེ། ཉན་ཐོས་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ན། དེ་ཙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་འབོགས་ལ།
en: Even if those hearers were to instruct and teach those bodhisattvas for as many eons as there are grains of sand in the Ganges, the bodhisattvas would just excel that much more through their practice of the perfection of discipline.

source: འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བས། ཉན་ཐོས་རྣམས་ནི་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ།
en: By dedicating the merit toward omniscience, they would surpass the hearers. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། གསེར་ནི་ཇི་ལྟ་ཇི་ལྟར་བཞུ་ཞིང་བསྐོལ་བ་དེ་ལྟ་དེ་ལྟར་ཆེས་འོད་གསལ་ཞིང་། ཆེས་ཁ་དོག་བཟང་པོར་འགྱུར་རོ།
en: Venerable Pūrṇa, as an analogy, the more gold is smelted and treated, the more it shines and the more refined its color.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་ཇི་ལྟ་ཇི་ལྟར་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་པ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཤིན་ཏུ་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །ཇི་ལྟ་ཇི་ལྟར་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་འདི་ལྟ་སྟེ།
en: Venerable Pūrṇa, likewise, the more people from the vehicle of the hearers instruct and teach the perfection of discipline to bodhisattvas, the purer the bodhisattvas’ discipline becomes.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བས། ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ།
en: The purer their discipline becomes, the more they dedicate the perfection of discipline toward attaining omniscience, thus surpassing those from the vehicle of the hearers.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་ནི་ཇི་ལྟ་ཇི་ལྟར་ནོར་བུའི་བྱི་དོར་མཁན་འཆང་བ་དེ་ལྟ་དེ་ལྟར་ཆེས་འོད་གསལ་བ་དང་། ཤིན་ཏུ་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, as a further analogy, the more a jeweler polishes a beryl gemstone, the purer it gets and the more it shines.

source: །དེ་བཞིན་དུ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་གིས། ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་པ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །ཇི་ལྟ་ཇི་ལྟར་ཤིན་ཏུ་ཡོངས་སུ་དག་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་འདི་ལྟ་སྟེ།
en: Likewise, the more people from the vehicle of the hearers instruct and teach the perfection of discipline to bodhisattvas, the purer the bodhisattvas’ perfection of discipline becomes.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའི་ཕྱིར་ཉན་ཐོས་རྣམས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ།
en: The purer their discipline, the more the bodhisattvas dedicate the perfection of discipline toward attaining omniscience. In this way they surpass all the hearers. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། རི་མོ་མཁན་ནམ། རི་མོ་མཁན་གྱི་སློབ་མ་ཤིན་ཏུ་ལོབས་པས་ཁ་དོག་སྣ་ལྔའི་ཚོན་གྱིས་ཇི་ལྟ་ཇི་ལྟར་ཁ་དོག་དང་། དབྱིབས་སུ་གཟུགས་འདྲི་ཞིང་ཚོན་བཀྱེ་སྟེ། རྫོགས་པར་བྱེད་ཅིང་ཤ་ཚོན་བྱེད་པ་དེ་ལྟ་དེ་ལྟར་ཡིད་དུ་འོང་ཞིང་ཆགས་པར་བྱེད་པར་འགྱུར་ཏེ།
en: Venerable Pūrṇa, as an analogy, the more a master painter, or a very experienced apprentice, makes use of the five colors to draw and paint various hues and shapes in exquisite and colorful ways, that much more beautiful and captivating the painting becomes.

source: གང་གིས་གཟུགས་རྣམས་བྲིས་པ་དེ་ཉིད་ཁ་དོག་དང་། དབྱིབས་ཀྱིས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ།
en: In this way, in terms of color and shape, the painting surpasses anyone else’s.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་གལ་ཏེ་ཉན་ཐོས་དཔག་ཏུ་མེད་པས། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་པ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་ཡོངས་སུ་དག་པར་འགྱུར་ཏེ། དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ནི་ཉན་ཐོས་རྣམས་ཟིལ་གྱིས་གནོན་ཅིང་སྣང་བར་བྱེད་དེ།
en: Venerable Pūrṇa, likewise, when countless hearers instruct and teach the perfection of discipline to bodhisattvas, the bodhisattvas’ perfection of discipline becomes purer and purer as the bodhisattvas surpass and outshine the hearers more and more.

source: འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བས། དེ་དག་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏོ།
en: By dedicating the entire perfection of discipline toward omniscience, they surpass all of them.
